###  Part # 1
  #### Terraform Format and Style 🖌`failure`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/e68ce9a1-9324-4e43-8801-95893c37661b/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.lambda_src has been deleted
  - resource "local_file" "lambda_src" {
      - filename             = "lambda_function.py" -> null
        id                   = "1db5fab865837150d42a64bdbb618ebbc5ea5c67"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "lambda_function.py"
      + type                = "zip"
    }

  # aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "EC2ControlAPI"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.route will be created
  + resource "aws_apigatewayv2_route" "route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /"
      + target             = (known after apply)
    }

  # aws_iam_role.lambda_role must be replaced
-/+ resource "aws_iam_role" "lambda_role" {
      ~ arn                   = "arn:aws:iam::928326215142:role/ec2_control_lambda_role" -> (known after apply)
      ~ create_date           = "2025-11-05T21:09:31Z" -> (known after apply)
      ~ id                    = "ec2_control_lambda_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "ec2_control_lambda_role" -> "EC2_Control_Lambda_Role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA5QJEN4XTG2FKXM5PV" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {
          - name   = "ec2_control_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ec2:StartInstances",
                              - "ec2:StopInstances",
                              - "ec2:DescribeInstances",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.lambda_policy must be replaced
-/+ resource "aws_iam_role_policy" "lambda_policy" {
      ~ id          = "ec2_control_lambda_role:ec2_control_policy" -> (known after apply)
      ~ name        = "ec2_control_policy" -> "EC2_Control_Lambda_Policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          + "ec2:DescribeInstances",
                            "ec2:StartInstances",
                            "ec2:StopInstances",
                          - "ec2:DescribeInstances",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ role        = "ec2_control_lambda_role" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_lambda_function.ec2_control will be created
  + resource "aws_lambda_function" "ec2_control" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_function.zip"
      + function_name                  = "EC2_Control_Lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 5
      + version                        = (known after apply)
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "EC2_Control_Lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # local_file.lambda_src will be created
  + resource "local_file" "lambda_src" {
      + content              = <<-EOT
            import json
            import boto3
            
            ec2 = boto3.client("ec2")
            
            TAG_KEY = "Environment"
            TAG_VALUE = "Dev"
            
            def list_instances():
                resp = ec2.describe_instances(
                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]
                )
                instances = []
                for r in resp["Reservations"]:
                    for i in r["Instances"]:
                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))
                        instances.append({"id": i["InstanceId"], "name": name, "state": i["State"]["Name"]})
                return instances
            
            def lambda_handler(event, context):
                action = event.get("action")
                instance_id = event.get("instance_id")
            
                if action == "list":
                    return {"statusCode": 200, "body": json.dumps(list_instances())}
            
                if not instance_id:
                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}
            
                if action == "start":
                    ec2.start_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}
            
                if action == "stop":
                    ec2.stop_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}
            
                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "lambda_function.py"
      + id                   = (known after apply)
    }

Plan: 8 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + api_endpoint = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # local_file.lambda_src has been deleted%0A  - resource "local_file" "lambda_src" {%0A      - filename             = "lambda_function.py" -> null%0A        id                   = "1db5fab865837150d42a64bdbb618ebbc5ea5c67"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.archive_file.lambda_zip will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "archive_file" "lambda_zip" {%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = "lambda_function.zip"%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_file         = "lambda_function.py"%0A      + type                = "zip"%0A    }%0A%0A  # aws_apigatewayv2_api.api will be created%0A  + resource "aws_apigatewayv2_api" "api" {%0A      + api_endpoint                 = (known after apply)%0A      + api_key_selection_expression = "$request.header.x-api-key"%0A      + arn                          = (known after apply)%0A      + execution_arn                = (known after apply)%0A      + id                           = (known after apply)%0A      + name                         = "EC2ControlAPI"%0A      + protocol_type                = "HTTP"%0A      + route_selection_expression   = "$request.method $request.path"%0A      + tags_all                     = (known after apply)%0A    }%0A%0A  # aws_apigatewayv2_integration.lambda_integration will be created%0A  + resource "aws_apigatewayv2_integration" "lambda_integration" {%0A      + api_id                                    = (known after apply)%0A      + connection_type                           = "INTERNET"%0A      + id                                        = (known after apply)%0A      + integration_response_selection_expression = (known after apply)%0A      + integration_type                          = "AWS_PROXY"%0A      + integration_uri                           = (known after apply)%0A      + payload_format_version                    = "2.0"%0A      + timeout_milliseconds                      = (known after apply)%0A    }%0A%0A  # aws_apigatewayv2_route.route will be created%0A  + resource "aws_apigatewayv2_route" "route" {%0A      + api_id             = (known after apply)%0A      + api_key_required   = false%0A      + authorization_type = "NONE"%0A      + id                 = (known after apply)%0A      + route_key          = "POST /"%0A      + target             = (known after apply)%0A    }%0A%0A  # aws_iam_role.lambda_role must be replaced%0A-/+ resource "aws_iam_role" "lambda_role" {%0A      ~ arn                   = "arn:aws:iam::928326215142:role/ec2_control_lambda_role" -> (known after apply)%0A      ~ create_date           = "2025-11-05T21:09:31Z" -> (known after apply)%0A      ~ id                    = "ec2_control_lambda_role" -> (known after apply)%0A      ~ managed_policy_arns   = [] -> (known after apply)%0A      ~ name                  = "ec2_control_lambda_role" -> "EC2_Control_Lambda_Role" # forces replacement%0A      + name_prefix           = (known after apply)%0A      - tags                  = {} -> null%0A      ~ tags_all              = {} -> (known after apply)%0A      ~ unique_id             = "AROA5QJEN4XTG2FKXM5PV" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A%0A      - inline_policy {%0A          - name   = "ec2_control_policy" -> null%0A          - policy = jsonencode(%0A                {%0A                  - Statement = [%0A                      - {%0A                          - Action   = [%0A                              - "ec2:StartInstances",%0A                              - "ec2:StopInstances",%0A                              - "ec2:DescribeInstances",%0A                            ]%0A                          - Effect   = "Allow"%0A                          - Resource = "*"%0A                        },%0A                    ]%0A                  - Version   = "2012-10-17"%0A                }%0A            ) -> null%0A        }%0A    }%0A%0A  # aws_iam_role_policy.lambda_policy must be replaced%0A-/+ resource "aws_iam_role_policy" "lambda_policy" {%0A      ~ id          = "ec2_control_lambda_role:ec2_control_policy" -> (known after apply)%0A      ~ name        = "ec2_control_policy" -> "EC2_Control_Lambda_Policy" # forces replacement%0A      + name_prefix = (known after apply)%0A      ~ policy      = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Action   = [%0A                          + "ec2:DescribeInstances",%0A                            "ec2:StartInstances",%0A                            "ec2:StopInstances",%0A                          - "ec2:DescribeInstances",%0A                        ]%0A                        # (2 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A      ~ role        = "ec2_control_lambda_role" # forces replacement -> (known after apply) # forces replacement%0A    }%0A%0A  # aws_lambda_function.ec2_control will be created%0A  + resource "aws_lambda_function" "ec2_control" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + filename                       = "lambda_function.zip"%0A      + function_name                  = "EC2_Control_Lambda"%0A      + handler                        = "lambda_function.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = false%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = (known after apply)%0A      + runtime                        = "python3.12"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = (known after apply)%0A      + source_code_size               = (known after apply)%0A      + tags_all                       = (known after apply)%0A      + timeout                        = 5%0A      + version                        = (known after apply)%0A    }%0A%0A  # aws_lambda_permission.apigw will be created%0A  + resource "aws_lambda_permission" "apigw" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "EC2_Control_Lambda"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = "AllowAPIGatewayInvoke"%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # local_file.lambda_src will be created%0A  + resource "local_file" "lambda_src" {%0A      + content              = <<-EOT%0A            import json%0A            import boto3%0A            %0A            ec2 = boto3.client("ec2")%0A            %0A            TAG_KEY = "Environment"%0A            TAG_VALUE = "Dev"%0A            %0A            def list_instances():%0A                resp = ec2.describe_instances(%0A                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]%0A                )%0A                instances = []%0A                for r in resp["Reservations"]:%0A                    for i in r["Instances"]:%0A                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))%0A                        instances.append({"id": i["InstanceId"], "name": name, "state": i["State"]["Name"]})%0A                return instances%0A            %0A            def lambda_handler(event, context):%0A                action = event.get("action")%0A                instance_id = event.get("instance_id")%0A            %0A                if action == "list":%0A                    return {"statusCode": 200, "body": json.dumps(list_instances())}%0A            %0A                if not instance_id:%0A                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}%0A            %0A                if action == "start":%0A                    ec2.start_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}%0A            %0A                if action == "stop":%0A                    ec2.stop_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}%0A            %0A                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "lambda_function.py"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 8 to add, 0 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  + api_endpoint = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @jangama3, Action: `pull_request`, Workflow: `Terraform`*